{
    "name": "Daniel Reeves",
    "descriptors": ["Designer", "Systems Thinker", "Builder"],
    "headshot": "images/about/headshot.jpg",    
    "contacts": {
        "email": "dan@dfrdesign.com",
        "phone": "617.894.3265",
        "linkedin": "https://www.linkedin.com/in/danielfreeves",
        "resume": "https://drive.google.com/file/d/1uMC-W5vMm9pj6NQboNhDfuzF-4RaMT_X/view?usp=sharing"
    },
    "secondary contact":
    {
        "text": "LinkedIn",
        "url": "https://www.linkedin.com/in/danielfreeves"
    },
    "bio": "Hello! I'm Daniel Reeves, a Boston-based product designer with over a decade experience. My road has been a bit unique, starting with a PhD in physics and including a stint designing and building delightful interactive multimedia installations. My passion for aesthetics and human-centricity informs both my design work and my hobbies. I'm currently looking for my next challenge in product design!",
    "as a sections":[
        {
            "title": "Designer",
            "text": "I'm a product and program designer for all sorts of cross-functional teams. I excel at bringing a structured and analytical approach, honed through my Ph.D. training, to bear on complex problems to find intuitive solutions and communicate them clearly to diverse audiences. I listen, think, and always advocate for the user."
        },
        {
            "title": "Scientist",
            "text": "Through my dissertation and two post-docs, I brought multiple disciplines and points of view together to understand problems at many scales. One common thread, shared across contexts of biology, chemistry, and geophysics, was building an understanding of how molecules interact in crowded environments. For publication list, visit https://www.researchgate.net/profile/Daniel-Reeves-2."
        },
        {
            "title": "Hobbyist",
            "text": "I enjoy woodworking, gardening, and playing with my cat. I like coaxing beautiful shapes and textures from the raw natural materials of wood and soil.",
            "images":[
                {
                    "src": "images/about/side1.jpeg",
                    "alt": "Handcrafted wooden side table",
                    "caption": "Wooden side table of maple, pine, and walnut."
                },
                {
                    "src": "images/about/side2.jpeg",
                    "alt": "Matching wooden side table",
                    "caption": "Matching side table."
                },
                {
                    "src": "images/about/table.jpeg",
                    "alt": "Robust wooden coffee table",
                    "caption": "Coffee table of maple and cherry. Danish oil finish."
                },
                {
                    "src": "images/about/trunk.jpeg",
                    "alt": "Vintage style wooden trunk with metal hardware",
                    "caption": "Wooden toy trunk built as a gift for my daughter. Poplar and hardwood ply with gel stain."
                },
                {
                    "src": "images/about/rack1.jpeg",
                    "alt": "Wine cabinet",
                    "caption": "Wine cabinet with glass storage (v2). Maple and pine."
                },              
                {
                    "src": "images/about/rack2.jpeg",
                    "alt": "Another view of the wall-mounted storage rack",
                    "caption": "Wine cabinet with glass storage (v1). Pine."
                },
                {
                    "src": "images/about/boards.jpeg",
                    "alt": "Collection of wooden cutting boards",
                    "caption": "Handmade wedding gift cutting boards. Maple and walnut."
                },
                {
                    "src": "images/about/lego.jpeg",
                    "alt": "Lego table and book case.",
                    "caption": "Lego work table and book case."
                }
            ]
        }
    ],
    "additional sections":[
        {
            "title": "About this logo",
            "text": "An evolution of a logotype.\n\n Elegant and simple.\n\n Evocative of math, architecture, and tools.",
            "images":[
                {
                    "src": "images/about/logo.jpg",
                    "alt": "Logo design showing geometric shapes",
                    "caption": "Logo evolution showing geometric progression"
                }
            ]
        },
        {
            "title": "About this portfolio",
            "text": "The code for this website is available on GitHub as the open-source platform WhisperWork. I built it to be easy to use for non coders, and easy to update and customize, as it is completely configurable from json files."
        }
    ]
}